v3/app/Models/Certificate/Index.php

	function gerarCertificadosForm($id = '', $ev = 2)
	{
		$sx = '';
		$sx .= '<h3>Gerar Certificados</h3>';
		$sx .= '<form method="post" action="' . base_url('admin/certificados/gerar') . '">'.chr(10);
		$sx .= '<div class="mb-3">' . chr(10);
		$sx .= '<label for="event" class="form-label">Evento</label>' . chr(10);
		$sx .= '<select class="form-select border border-secondary" id="event" name="event">' . chr(10);
		$EventModel = new \App\Models\Event\Events();
		$events = $EventModel->orderBy('e_data_f', 'desc')->findAll();
---
SELECT *
FROM `event`
ORDER BY `e_data_f` DESC

	function gerarCertificadoDB($name, $email, $ev, $tp)
	{
		$tp = 3;
		$data = '2025-06-25';
		$CertificadoOutros = new \App\Models\Certificate\CertificadoOutros();
		$data = [
			'c_nome' => $name,
			'c_email' => $email, // Certificado
			'c_certificado' => $tp,
			'c_data' => $data,
			'e_evento'=> $ev
		];

		$dt = $CertificadoOutros
			->where('c_certificado', $tp)
			->where('c_email', $email)
			->where('e_evento', $ev)
			->first();

		if ($dt == []) {
			// Verifica se o certificado já existe
			$CertificadoOutros->set($data)->insert();
---
SELECT *
FROM `certificado_outros`
WHERE `c_certificado` = 2
AND `c_email` = 'armarius.araujo@gmail.com'
AND `e_evento` = '3'
 LIMIT 1
INSERT INTO `certificado_outros` (`c_nome`, `c_email`, `c_certificado`, `c_data`, `e_evento`) VALUES ('Andre Vieira de Freitas Araújo', 'armarius.araujo@gmail.com', 2, '2025-06-25', '3')