v2/app/Models/Event/EventInscritos.php

	function subscribe($UserId, $id, $lote)
		{
			$dt = $this->where('ein_event', $id)
				->where('ein_user', $UserId)
				->where('ein_tipo', $lote)
				->first();
---
SELECT *
FROM `event_inscritos`
WHERE `ein_event` = '2'
AND `ein_user` = '239'
AND `ein_tipo` = '2'
 LIMIT 1