v2/app/Models/Event/Events.php

	function getEvents()
		{
			$dt = [];
			$dt = $this->where('e_sigin_until >= ', date('Y-m-d'))->findAll();
---
SELECT *
FROM `event`
WHERE `e_sigin_until` >= '2025-01-28'